functions.org
#+TITLE: My Extras
#+PROPERTY: header-args:emacs-lisp :tangle shared/.config/emacs/functions.el

* My Extras
This document contains helper methods that used to reside in my init.el but I wanted to have them in a separate file.

** Best practices
#+begin_src emacs-lisp
;; -*- lexical-binding: t -*-
#+end_src
 
** Destructuring a JWT
A little helper method to destruct a JWT to see whats in it.
#+begin_src emacs-lisp
  (defun df/destruct-jwt ()
  "decodes the current region as a jwt and prints it instead."
  (interactive)
  (let* ((jwt (buffer-substring (region-beginning) (region-end)))
         (parts (string-split jwt "\\."))
         (header (base64-decode-string (nth 0 parts) t nil))
         (payload (base64-decode-string (nth 1 parts) t nil)))
    (kill-region (region-beginning) (region-end))
    (insert "\n")

    ;; Insert and pretty-print the header
    (let ((start (point)))
      (insert header)
      (json-pretty-print start (point)))

    (insert "\n.\n")

    ;; Insert and pretty-print the payload
    (let ((start (point)))
      (insert payload)
      (json-pretty-print start (point)))

    (insert "\n.\n")
    (insert (nth 2 parts))
    (insert "\n")))
#+end_src

** Convert a timestamp to a date string
#+begin_src emacs-lisp
  (defun df/epoch-to-string (epoch)
    (interactive "insert epoch")
    (let ((date (format-time-string
                 "%Y-%m-%d %H:%M:%S"
                 (seconds-to-time
      			(string-to-number
      			 (buffer-substring (region-beginning) (region-end)))))))
      (delete-region (region-beginning) (region-end))
      (insert date)))
#+end_src

** Generate and insert a uuid
#+begin_src emacs-lisp
  (defun df/insert-uuid ()
      "Inserts a uuid, calling the external method uuidgen"
      (interactive)
  	(insert (string-trim (shell-command-to-string "uuidgen -r"))))
#+end_src

** Copy the buffer path to the kill ring
#+begin_src emacs-lisp
  (defun df/copy-buffer-path-to-kill-ring ()
      "Copy the file path of a buffer to the clipboard"
      (interactive)
  	(kill-new (buffer-file-name)))
#+end_src

** Join lines together with a specifid start, delimiter and end
#+begin_src emacs-lisp
  (defun df/my-joiner (&optional j-del j-start j-end)
      "Join a region of lines separated by j-del and surrounded by j-start and j-end"
      (interactive "sDelimiter ',': \nsStart (': \nsEnd '): ")
      (let* ((my-text (buffer-substring (region-beginning) (region-end)))
          	 (lines (remove "" (mapcar 'string-trim (string-split my-text "\n"))))
          	 (delimiter (if (string-empty-p j-del) "','" j-del))
          	 (start (if (string-empty-p j-start) "('" j-start))
          	 (end (if (string-empty-p j-end) "')" j-end)))
        (delete-region (region-beginning) (region-end))
        (insert
         (concat start
    			 (string-join lines delimiter)
    			 end))
  	  ))
#+end_src

** Filter out private paths from recent files list.
#+begin_src emacs-lisp
  (defun df/filter-private ()
    "Remove private items from recentf list"
    (interactive)
    (setq recentf-list (-filter (lambda (x) (not (s-contains? ".private" x))) recentf-list)))
#+end_src

** Insert the current date
#+begin_src emacs-lisp
  (defun df/insert-current-date ()
      (interactive)
      (insert
  	 (format-time-string "%Y-%m-%d")))
#+end_src

** List all available fonts
#+begin_src emacs-lisp
  (defun df/list-all-fonts ()
    (interactive)
    (with-output-to-temp-buffer "*fonts*"
      (princ (string-join (font-family-list) "\n"))
      (goto-char (point-min)))
    (view-mode 1))
#+end_src

* Bringing it all together

** Show a hydra with my functions
#+begin_src emacs-lisp
  (defhydra df/funs (:hint nil :color blue)
    "
  _h_:\tConvert an *epoch* to a date-string          _j_: Insert current date
  \t\tThe epoch must be in a region for this       _l_: Join lines
  \t\tto work.                                     _r_: Filter private

  _k_:\tCopy buffer path to kill ring
  _m_:\tOpen EMPV _d_: Destruct a JWT
  _q_:\tQuit


  "
    ("h" df/epoch-to-string)
    ("j" df/insert-current-date)
    ("k" df/copy-buffer-path-to-kill-ring)
    ("l" df/my-joiner)
    ("r" df/filter-private)
    ("m" empv-hydra/body)
    ("d" df/destruct-jwt)
    ("q" nil "quit"))

  (keymap-global-set "C-x m" 'df/funs/body)

#+end_src
